# Part 5 — Pandas translations of SQL queries

In [8]:
# Imports and configuration
import os
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.engine import URL
from datetime import datetime, timedelta

# Load DB URI from env or placeholder
# Update DB_URI with your actual credentials (default uses password 'Admin')
DB_URI = os.getenv(
    'LIBRARY_DB_URI',
    'postgresql://postgres:Admin@localhost:5432/library_db'
)
engine = create_engine(DB_URI)

# Quick connection test (will raise if invalid)
from sqlalchemy import text

with engine.connect() as conn:
    result = conn.execute(text('SELECT 1'))
    print('Connection test result:', result.scalar())

Connection test result: 1

## Load tables into Pandas DataFrames

In [10]:
# Loading tables into DataFrames
df_authors = pd.read_sql('SELECT * FROM Authors', engine)
df_books = pd.read_sql('SELECT * FROM Books', engine)
df_borrow = pd.read_sql('SELECT * FROM Borrow_History', engine)
df_members = pd.read_sql('SELECT * FROM Members', engine)
df_bookorders = pd.read_sql('SELECT * FROM BookOrders', engine)

print('Loaded:', {
    'Authors': len(df_authors),
    'Books': len(df_books),
    'Borrow_History': len(df_borrow),
    'Members': len(df_members),
    'BookOrders': len(df_bookorders)
})

Loaded: {'Authors': 50, 'Books': 100, 'Borrow_History': 150, 'Members': 75, 'BookOrders': 80}

### Query 1 — Q3

In [11]:
# Task 1: Top 20 authors by number of books written
if 'first_name' in df_authors.columns and 'last_name' in df_authors.columns:
    df_authors['author_name'] = df_authors['first_name'].fillna('') + ' ' + df_authors['last_name'].fillna('')
else:
    
    df_authors['author_name'] = df_authors.get('name', df_authors.get('author_name', 'Unknown'))

q1 = df_books.merge(df_authors, on='author_id', how='left')
q1 = q1.groupby(['author_id', 'author_name'], dropna=False).agg(book_count=('book_id', 'count')).reset_index()
q1 = q1.sort_values('book_count', ascending=False)
q1.head(20)

    author_id               author_name  book_count
10         11           Agatha Christie           5
9          10              J.K. Rowling           5
8           9              Stephen King           5
11         12              Paulo Coelho           5
12         13           Khaled Hosseini           4
1           2           Haruki Murakami           3
0           1           Margaret Atwood           3
6           7    Gabriel García Márquez           3
5           6             Toni Morrison           3
4           5            Salman Rushdie           3
3           4            Elena Ferrante           3
2           3  Chimamanda Ngozi Adichie           3
7           8         Yuval Noah Harari           3
14         15                  Ayn Rand           3
19         20            Kazuo Ishiguro           3
33         34          Malcolm Gladwell           3
36         37               Neil Gaiman           3
13         14            Isabel Allende           2
15         16             Chinua Achebe           2
21         22          Jonathan Franzen           2

### Query 2 — Q7

In [13]:
q2 = df_borrow.groupby('book_id').agg(times_borrowed=('borrowed_id', 'count')).reset_index()
q2 = q2.merge(df_books[['book_id', 'title']], on='book_id', how='left')
q2 = q2.sort_values('times_borrowed', ascending=False).head(5)
q2

    book_id  times_borrowed                                     title
0         1               3                       The Handmaid's Tale
1         2               3                                 Cat's Eye
29       30               3  Harry Potter and the Philosopher's Stone
3         4               2                            Norwegian Wood
25       26               2                                        It

### Query 3 — Q9

In [14]:
q3 = df_books.groupby('genre', dropna=False).agg(avg_available_copies=('available_copies', 'mean')).reset_index()
q3 = q3.sort_values('avg_available_copies', ascending=False)
q3

                    genre  avg_available_copies
9                  Memoir              3.800000
3                 Fantasy              3.583333
11            Non-fiction              3.285714
16        Science Fiction              3.000000
17          Short Stories              3.000000
1       Dystopian Fiction              3.000000
14                Romance              3.000000
18                 Travel              3.000000
10                Mystery              2.800000
6                  Horror              2.500000
15                Science              2.500000
4      Historical Fiction              2.333333
0   Children's Literature              2.000000
13       Post-apocalyptic              2.000000
5      Historical Mystery              2.000000
12  Philosophical Fiction              2.000000
7        Literary Fiction              1.810811
8         Magical Realism              1.750000
2                   Essay              1.000000

### Query 4 — Q12

In [16]:
# Task 4: Monthly borrowing trends for the past year
df_borrow['borrow_date'] = pd.to_datetime(df_borrow['borrow_date'])
one_year_ago = pd.Timestamp.now() - pd.DateOffset(years=1)
df_borrow_last_year = df_borrow[df_borrow['borrow_date'] >= one_year_ago]
df_borrow_last_year['year_month'] = df_borrow_last_year['borrow_date'].dt.to_period('M').dt.to_timestamp()
q4 = df_borrow_last_year.groupby('year_month').agg(borrows=('borrowed_id', 'count')).reset_index()
q4 = q4.sort_values('year_month')
q4

Empty DataFrame
Columns: [year_month, borrows]
Index: []

### Query 5 — Q13

In [18]:
# total borrows per book
book_borrows = df_borrow.groupby('book_id').agg(times_borrowed=('borrowed_id', 'count')).reset_index()
book_borrows = book_borrows.merge(df_books[['book_id', 'title', 'author_id']], on='book_id', how='left')
# total borrows per author
author_borrows = book_borrows.groupby('author_id').agg(total_borrows=('times_borrowed', 'sum')).reset_index()

popular_authors = author_borrows[author_borrows['total_borrows'] > 10]
most_popular = book_borrows.sort_values(['author_id', 'times_borrowed'], ascending=[True, False]).groupby('author_id').first().reset_index()

# Merging to get popular book details
popular_authors = popular_authors.merge(most_popular[['author_id', 'book_id', 'title', 'times_borrowed']], on='author_id', how='left')
popular_authors = popular_authors.merge(df_authors[['author_id', 'author_name']], on='author_id', how='left')
popular_authors = popular_authors[['author_id', 'author_name', 'total_borrows', 'book_id', 'title', 'times_borrowed']]
popular_authors

Empty DataFrame
Columns: [author_id, author_name, total_borrows, book_id, title, times_borrowed]
Index: []